{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "[FAM_MOSFET]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "[FAM_IGBT]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "[FAM_IC]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "[CLS]": 4,
      "[SEP]": 5,
      "[MASK]": 6,
      "[FAM_MOSFET]": 7,
      "[FAM_IGBT]": 8,
      "[FAM_IC]": 9,
      "ALIGN_MASK_LEVEL_1": 10,
      "ALIGN_MASK_LEVEL_2": 11,
      "ALIGN_MASK_LEVEL_3": 12,
      "ALIGN_MASK_LEVEL_4": 13,
      "ALIGN_MASK_LEVEL_5": 14,
      "ALIGN_MASK_LEVEL_6": 15,
      "ANISOTROPIC_ETCH_SPACER": 16,
      "ANNEAL_DIELECTRIC": 17,
      "ANNEAL_METAL": 18,
      "ANNEAL_METAL_1": 19,
      "ANNEAL_OXIDE": 20,
      "ANNEAL_POLYSILICON": 21,
      "BACKSIDE_ANNEAL": 22,
      "BACKSIDE_CLEAN": 23,
      "BACKSIDE_CLEAN_FINAL": 24,
      "BACKSIDE_DRY": 25,
      "BACKSIDE_ETCH_CLEAN": 26,
      "BACKSIDE_GRIND": 27,
      "BACKSIDE_METALLIZATION_PREP": 28,
      "BACKSIDE_RINSE": 29,
      "BACKSIDE_THINNING_CHECK": 30,
      "BREAKDOWN_VOLTAGE_TEST": 31,
      "CLEAN_AFTER_ETCH": 32,
      "CLEAN_AFTER_FIELD_ETCH": 33,
      "CLEAN_AFTER_METAL_ETCH": 34,
      "CLEAN_AFTER_OXIDE_ETCH": 35,
      "CLEAN_AFTER_POLY_ETCH": 36,
      "CLEAN_AFTER_VIA_ETCH": 37,
      "CLEAN_AFTER_WINDOW_ETCH": 38,
      "CLEAN_PAD_OPENING": 39,
      "CMP_DIELECTRIC": 40,
      "CMP_INTERLAYER_DIELECTRIC": 41,
      "CMP_METAL": 42,
      "CMP_VIA_FILL": 43,
      "CURE_PASSIVATION": 44,
      "DENSIFY_DIELECTRIC": 45,
      "DENSIFY_OXIDE": 46,
      "DEPOSIT_BACKSIDE_METAL": 47,
      "DEPOSIT_BACKSIDE_PROTECTION": 48,
      "DEPOSIT_BARRIER_METAL": 49,
      "DEPOSIT_FIELD_OXIDE": 50,
      "DEPOSIT_GATE_OXIDE_OR_DIELECTRIC": 51,
      "DEPOSIT_INTERLAYER_DIELECTRIC": 52,
      "DEPOSIT_INTERLEVEL_DIELECTRIC": 53,
      "DEPOSIT_METAL_1": 54,
      "DEPOSIT_METAL_SEED": 55,
      "DEPOSIT_PAD_OXIDE": 56,
      "DEPOSIT_PASSIVATION": 57,
      "DEPOSIT_PASSIVATION_LAYER": 58,
      "DEPOSIT_POLYSILICON": 59,
      "DEPOSIT_SPACER_DIELECTRIC": 60,
      "DEPOSIT_TOP_METAL": 61,
      "DEPOSIT_TUNGSTEN_SEED": 62,
      "DEVELOP_PAD_WINDOW": 63,
      "DEVELOP_PHOTORESIST": 64,
      "DIELECTRIC_ETCH_VIA": 65,
      "DRIVE_IN_DIFFUSION": 66,
      "DRY_WAFER": 67,
      "DRY_WAFER_BACKSIDE": 68,
      "ELECTRICAL_PARAMETRIC_TEST": 69,
      "EPITAXIAL_DEPOSITION": 70,
      "EPITAXIAL_LAYER_PREP": 71,
      "EPITAXIAL_REWORK_CHECK": 72,
      "EPITAXIAL_WAFER_CHECK": 73,
      "EPITAXY_ANNEAL": 74,
      "EPITAXY_PREP": 75,
      "ETCH_SILICON_OR_OXIDE_WINDOW": 76,
      "ETCH_WET_BACKSIDE": 77,
      "EXPOSE_LITHO_LEVEL_1": 78,
      "EXPOSE_LITHO_LEVEL_2": 79,
      "EXPOSE_LITHO_LEVEL_3": 80,
      "EXPOSE_LITHO_LEVEL_4": 81,
      "EXPOSE_LITHO_LEVEL_5": 82,
      "EXPOSE_LITHO_LEVEL_6": 83,
      "FIELD_OXIDE_ETCH": 84,
      "FIELD_PATTERN_INSPECTION": 85,
      "FILL_VIA_METAL": 86,
      "FILL_VIA_TUNGSTEN": 87,
      "FINAL_CD_INSPECTION": 88,
      "FINAL_CLEAN": 89,
      "FINAL_ELECTRICAL_TEST_PREP": 90,
      "FINAL_GEOMETRY_CHECK": 91,
      "FINAL_LOT_RELEASE": 92,
      "FINAL_OXIDE_CHECK": 93,
      "FINAL_PARTICLE_INSPECTION": 94,
      "FINAL_THICKNESS_MEASURE": 95,
      "FRONTSIDE_CLEAN": 96,
      "FRONTSIDE_CLEAN_FINAL": 97,
      "GATE_OXIDE_GROWTH": 98,
      "GATE_OXIDE_PREP": 99,
      "GRINDING_WAFER_BACKSIDE": 100,
      "HARD_BAKE": 101,
      "HF_DIP": 102,
      "IMPLANT_CHANNEL_STOP": 103,
      "IMPLANT_DRAIN_/_CATHODE_REGION": 104,
      "IMPLANT_LDD": 105,
      "IMPLANT_N-TYPE": 106,
      "IMPLANT_N_BUFFER": 107,
      "IMPLANT_P_BODY": 108,
      "IMPLANT_SOURCE_DRAIN": 109,
      "IMPLANT_SOURCE_REGION": 110,
      "IMPLANT_WELL": 111,
      "INITIAL_WAFER_INSPECTION": 112,
      "INSPECT_PATTERN_LEVEL_1": 113,
      "LEAKAGE_TEST": 114,
      "LIGHT_ANNEAL": 115,
      "LOT_IDENTIFICATION": 116,
      "LOT_RELEASE": 117,
      "MEASURE_BACKSIDE_CONTACT": 118,
      "MEASURE_BACKSIDE_ROUGHNESS": 119,
      "MEASURE_CD_LEVEL_1": 120,
      "MEASURE_CD_LEVEL_2": 121,
      "MEASURE_CONTACT_RESISTANCE": 122,
      "MEASURE_DEVICE_PARAMETER": 123,
      "MEASURE_DIELECTRIC_THICKNESS": 124,
      "MEASURE_EPITAXY_THICKNESS": 125,
      "MEASURE_FILM_THICKNESS": 126,
      "MEASURE_GATE_CD": 127,
      "MEASURE_GATE_OXIDE_THICKNESS": 128,
      "MEASURE_GEOMETRY": 129,
      "MEASURE_INITIAL_GEOMETRY": 130,
      "MEASURE_INITIAL_THICKNESS": 131,
      "MEASURE_JUNCTION_DEPTH": 132,
      "MEASURE_JUNCTION_PROFILE": 133,
      "MEASURE_LINE_WIDTH": 134,
      "MEASURE_METAL_THICKNESS": 135,
      "MEASURE_OPENING_CD": 136,
      "MEASURE_OXIDE_QUALITY": 137,
      "MEASURE_OXIDE_THICKNESS": 138,
      "MEASURE_PAD_OPENING": 139,
      "MEASURE_PASSIVATION_QUALITY": 140,
      "MEASURE_PASSIVATION_THICKNESS": 141,
      "MEASURE_PLANARITY": 142,
      "MEASURE_POLY_THICKNESS": 143,
      "MEASURE_RESISTIVITY": 144,
      "MEASURE_SHEET_RESISTANCE": 145,
      "MEASURE_SPACER_WIDTH": 146,
      "MEASURE_SURFACE_DEFECTS": 147,
      "MEASURE_SURFACE_PARTICLES": 148,
      "MEASURE_SURFACE_PLANARITY": 149,
      "MEASURE_SURFACE_UNIFORMITY": 150,
      "MEASURE_THICKNESS": 151,
      "MEASURE_VIA_CD": 152,
      "MEASURE_VIA_RESISTANCE": 153,
      "MEASURE_WAFER_THICKNESS": 154,
      "MEASURE_WINDOW_CD": 155,
      "METAL_ETCH": 156,
      "METAL_ETCH_DRY": 157,
      "METAL_PATTERN_INSPECTION": 158,
      "OPEN_BOND_PAD_WINDOW": 159,
      "OPEN_PAD_WINDOW": 160,
      "OPEN_PAD_WINDOW_LITHO": 161,
      "OXIDE_ETCH": 162,
      "OXIDE_ETCH_DRY": 163,
      "OXIDE_STRIP": 164,
      "PACKAGE_PREPARATION": 165,
      "PAD_WINDOW_LITHO": 166,
      "PARAMETRIC_TEST": 167,
      "PASSIVATION_ETCH": 168,
      "PASSIVATION_ETCH_PAD_OPENING": 169,
      "PATTERN_INSPECTION_LEVEL_1": 170,
      "PATTERN_INSPECTION_LEVEL_2": 171,
      "POLYSILICON_ANNEAL": 172,
      "POLYSILICON_ETCH": 173,
      "POLYSILICON_ETCH_DRY": 174,
      "POLY_PATTERN_INSPECTION": 175,
      "POST_EXPOSE_BAKE": 176,
      "PRE_ANNEAL_CHECK": 177,
      "PRE_CLEAN_INSPECTION": 178,
      "PRE_CLEAN_WAFER": 179,
      "P_BODY_WINDOW_INSPECTION": 180,
      "RAPID_THERMAL_ANNEAL": 181,
      "RCA_CLEAN_1": 182,
      "RCA_CLEAN_2": 183,
      "RECEIVE_WAFER_LOT": 184,
      "RINSE_WET_WAFER_EDGE": 185,
      "SHIP_LOT": 186,
      "SOFT_BAKE": 187,
      "SPIN_COAT_PHOTORESIST": 188,
      "STRIP_PHOTORESIST": 189,
      "STRIP_RESIST": 190,
      "STRIP_RESIST_LEVEL_2": 191,
      "STRIP_RESIST_LEVEL_4": 192,
      "STRIP_RESIST_PAD_WINDOW": 193,
      "SUBSTRATE_CHECK": 194,
      "SURFACE_PREP_FOR_DEPOSITION": 195,
      "SWITCHING_TEST": 196,
      "THERMAL_OXIDATION": 197,
      "THRESHOLD_VOLTAGE_TEST": 198,
      "VIA_ETCH": 199,
      "VIA_ETCH_THROUGH_DIELECTRIC": 200,
      "VIA_INSPECTION": 201,
      "VIA_OPENING_INSPECTION": 202,
      "WAFER_CLEAN_PRE-GRIND": 203,
      "WAFER_CLEAN_PRE_PROCESS": 204,
      "WAFER_SORT_TEST": 205,
      "WAFER_SURFACE_CLEAN": 206,
      "WET_CLEAN_RCA1": 207,
      "WET_CLEAN_RCA2": 208,
      "YIELD_ANALYSIS": 209
    },
    "unk_token": "[UNK]"
  }
}